Revit 2026 API

# MetalMetalPatina Property

---

The property labeled "Patina" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPatina { get; }
```
```vb
Public Shared ReadOnly Property MetalPatina As String
	Get
```
```cpp
public:
static property String^ MetalPatina {
	String^ get ();
}
```
```fsharp
static member MetalPatina : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace